<?
$locale="ja_JP";
$eses="ja";
$lang="ja";
$mem="会員";
$onl="オンライン";
$help="助けて";
$idioma="言語";
$longer="3文字以上である必要があります";
$bold="大胆な";
$italic="イタリック";
$insert="コンテンツを挿入する";
$paste="ローカルリンクを貼り付け";
$selectfile="押してファイルまたはカメラを選択します";
$postnews="別のカテゴリに投稿する";
$postapoll="投票を投稿する";
$postcontent="コンテンツを投稿する";
$pcontent="コンテンツのカテゴリを変更...メニュー";
$pcontentb="コンテンツの説明の下にあるボタンを使用";
$insertpoll="投票を挿入";
$polloption="オプション";
$waitres="利用可能なリソースを待機しています";
$expiresin="期限切れ";
$days="日々";
$hour="時間";
$losevotes="あなたはすべての票を失います。 本気ですか？";
$vote="投票";
$expired="この投票は期限切れになり、投票を認めなくなりました";
$res="結果";
$more="さらにコンテンツを読み込む";
$visitors="訪問者";
$browser="ブラウザ";
$visitora="訪問者分析";
$estimated="推定総数";
$dev="端末";
$use="中古";
$pho="写真";
$guide="訪問数を最大化するためのガイド";
$tnma="ドラッグアンドドロップで並べ替えをアクティブにする";
$tnmd="ドラッグアンドドロップで並べ替えを無効にする";
$wrong="間違ったユーザー名またはパスワード";
$createch="チャプターリストを作成";
$chaptertitle="章を選択";
$vpcreate="ビデオ部分を投稿する";
$vpfrom="からのビデオ部分";
$trend="今見ています";
$part="ビデオパーツ";
$movie="フィーチャー映画";
$news="記事とニュース";
$video="短編映画";
$photo="写真";
$sequence="写真シーケンス";
$meme="ミーム";
$top="人気";
$recom="関連した";
$all="すべて見る";
$about="公開しました";
$related="関連した";
$relatedto="に関連";
$repeat="リピートモード";
$quality="品質";
$subtitles="字幕";
$skateproof="あなたがスケートボーダーであることを証明する";
$dragtwofeet="一致するように2つの靴をドラッグアンドドロップします";
$signupparents="スケートボードに関係のない人は、なぜアカウントが必要なのかを $webemail に書いて、アカウントをリクエストできます。";
$unlock="ロックを解除する";
$auto="自動検出";
$premiere="オンラインプレミア";
$denunciar="報告する";
$dentitulo="なぜ報告したいのですか？";
$den[0]="管理者に通知されました";
$den[1]="不適切なコンテンツ";
$den[2]="いじめや嫌がらせ";
$den[3]="著作権侵害";
$hidepost="この投稿を二度と見せないでください";
$showpost="この投稿を見せて";
$watchfullvideo="あなたはビデオパートを見ました、あなたは完全なビデオを見たいですか？";
$deluser="アカウントを削除する";
$deluserm="あなたはすべてのあなたのアカウントデータとあなたのアカウントを永久にそして取り返しのつかないようにクリックすることによって削除します";
$crop="ビデオをトリミング";
$slowmotion="スローモーション";
$addpadding="パディングを追加する";
$nextin="次の";
$newplaylist="新規プレイリスト";
$writeplaylistname="プレイリストの名前を書く";
$duplicado="繰り返される";
$donate="寄付";
$darpropina="チップの送付先";
$monetizar="収益化する";
$monetizapierde="あなたはこのビデオで育てられたすべてを永久に失うでしょう、 $p8";
$monetizainfo="それがどのように機能するかを読む";
$pesodelvoto="ひょう量";
$poderdevoto="投票値";
$contenidoexclusivo="他のプラットフォームで過去に公開された内容の投稿はご遠慮ください。ありがとうございました。";
$instatrap="Skate Hypeのアプリに入っていません。Instagramを終了するには、右上の三点メニューから、...で開いてください。";

$responder="返事";
$verrespuestas="答えを見る";
$qrclick="QRコードをクリックすると、Hive Keychain Mobile（Hive認証アプリ）が起動し、リクエストを承認することができます。";

$retirar="撤退";
$retiros="引き出し";
$retiraropciones="引き出しオプション";
$nosuficiente="撤退できる最低額に達していない";
$balance="バランス";
$extrafilmerrewards="フィルムメーカー・リワードの追加";
$susolicitud="コードを使用した引き出しリクエスト";
$pendiente="引き出しリクエストは確認待ちです";
$procesando="処理中です";
$dirretiro="引き出しアドレス";
$todocorrecto="すべてが正しければ、次のリンクにアクセスして引き出しを確認してください";
$gracias="どうもありがとうございました！";

$hivecuenta="Hive アカウント";
$hivecrea="作成する $hivecuenta";
$hivecartera="Hive Keychain ウォレットをインストールします";
$hivecomunidad="SkateHive コミュニティ";
$hivesubscribe="購読する";
$hiveconnecta="接続";

$p1="公開する";
$p2="編集する";
$p3c="コメント";
$p3="もっと見せる";
$p4="コメントを追加...";
$p4m="伝言を残す...";
$p6="コメントを削除";
$p7="削除する";
$p8="本気ですか？";
$p9="絶対です ";
$p10=" または ";
$p11="登録";
$p12="空のコメント";
$p27="ビデオサムを更新する";
$p27a="アルバムの親指を更新する";
$p27f="写真を更新";
$p28="シーケンスの最後の写真を削除";
$p30="埋め込む";
$p31="ダウンロード";
$p32="トリックをダウンロードする";
$p32p="トリックをダウンロードしました";
$p33="に投稿 Plaza & ダウンロードリンクを作成する";
$block="このユーザーをブロックする";

$st1="このメニューを閉じる";
$st2="このリンクをコピー";
$st2t="この秒でコピー";
$st3="コピーした";
$st5="投稿に移動";
$st6="シェア";
$st7="友達";
$st8="友達を削除";
$st9="友人を追加する";
$st10="友達リスト";
$st10m="続く";
$st10o="フォロワー";
$st11="閉じる";
$st12="タイトルは $minwordtit 語以上 $maxchartit 文字以下である必要があります";
$st13="説明は $minworddesc 語以上 $maxchardesc 文字以下である必要があります";
$st14="タイトル（最低 $minwordtit ワード）";
$st15="説明（最低 $minworddesc ワード）";
$st16="保存して公開";
$st18="削除する";
$st18a="追加";
$st19=$p2;
$st20="セーブ";
$st21="景色";
$st22="探す";
$st23="写す";
$st25="サインアップ！";
$mdesc[0]="いらっしゃいませ！ これは、ビデオ、写真、シーケンスを共有できるスケートボード専用のサイトです。";
$mdesc[1]="iOSアプリとAndroidアプリが利用可能で、ChromeCastとAirPlayをサポートしています。";
$mdesc[2]="クッキーもデータ追跡もありません。スケートボードだけです。";
$st27="新しいアルバム";
$st28="ログインする必要があります。ログインしますか？";
$st29="ユーザー名";
$st30="パスワード";
$st31="Skate Hype へようこそ";
$st32="別のタブまたはブラウザで動画をアップロードしているようです。 別の動画をアップロードする前に、プロセスを完了する必要があります。";
$st33="すべてを削除して開始";
$st34="あなたはアカウントを持っていないのですか？";
$st35="ここから再開して続行";

$dd0="刊行物";
$dd1="でタグ付けされています";
$dd2="アルバム";
$dd3="プレイリスト";

$a4="アルバムのコンテンツを管理する";
$a5="すべてのコンテンツ。 クリックして置きます。";
$a6="アルバムのコンテンツ。 クリックして削除します。";
$a7="スクリーンショットを作成";
$a8="隠す";
$a2="このアルバムを削除します。 本気ですか？";

$ing1="住む";
$ing2="そして";
$ing3="歳";

$m1="ログインする";
$m2="サインアップ";
$m3="コントロールパネル";
$m4="私のプロフィール";
$m5="パスワードを紛失した場合は、 ";
$m6="パスワード復旧";
$m7="通知を読む";

$titlemain="Skate Hype";
$keywordsmain="スケート、スケートボーダー、スケートボード、ビデオ、スケートビデオ、ビデオプラットフォーム";
$descriptionmain=$mdesc[0];

$afp="プロフィール写真を更新してください";

$d0="ビデオのサムネイルをアップロードまたは選択します";
$d1="アップロードする";
$d2="選択する";
$d3="目的のフレームまでビデオを再生し、保存します。";
$d4="探す";
$d5="選択済み";
$d6="セーブ";

$t1="この動画を削除しますか？";
$t1f="この写真を削除しますか？";
$t2="会話";
$t3="私をタグして";
$t4="タグ付け";
$t5="タグ付け";
$t6="アスペクト比を変更する";
$t7="投稿タイプの変更";
$t9="タグを削除";
$t10="ユーザーの名前を入力します";
$t11="ユーザーを選択";
$t12="ユーザーにタグを付ける";
$t13="キャンセル";
$t14="ユーザーを選択";

$d00=$m3;
$d01="プロファイルデータを変更する";
$d02="プロフィール写真を変更する";
$d03="プロフィール";
$d04="コンテンツ";
$d06="パスワードを変更する";
$d7="写真をアップロード";
$d8="写真シーケンスをアップロードする";
$d9="ビデオをアップロードする";
$d11="変化する";
$d13="ログアウト";
$d16="アップロードする";
$d17="シーケンスを形成するすべてのjpg画像を正しい順序で選択し、それらをアップロードして、発行を確認します。 最大24枚の写真。";
$d18="写真を選択";
$d19="写真は全部ですか？ 次にクリックします";
$d20="すべての写真をアップロード";
$d21="正しい順番になっている場合は、";
$d22="さもないと";
$d23="キャンセル";
$d24="背景のプロフィール写真を変更する";
$d25="以前のパスワード";
$d26="新しいパスワード";
$d27=" 送る ";
$d33="8文字以上、大文字1つ、数字1つ";
$d34="パスワードが変更されました。メールを確認してください";
$d35="ビデオのエンコード";
$d36="ファイルの多重化と仕上げ";
$d39="すべてのステップを待つ";
$d40="公開する";
$d41="お知らせ";
$d42="通知を削除する";
$d43="通知を読む";
$d44="終了するとアップロードがキャンセルされます";
$d47="オプションを保存しました";
$d49="URLが間違っています。例に従ってください";
$d56="キャンセルして削除";
$d62="メッセージを読む";
$d63="メッセージを読む";
$d64="個人情報保護方針";
$d65="私は受け入れます";

$t00=$m2;
$t01="確認のためメールをお送りしました";	
$t02="数分かかることもあります。 登録プロセスを繰り返す場合は、を押します ";	
$t03="Cookieを削除して更新する";
$t08="$st29 （4〜24文字）";
$t09="本名";
$t010="姓または姓";
$t011="街（スケートをする場所）";
$t012=$m2;
$t15="登録に使用したメールを挿入してください";
$t16="メールでアクセス";
$t17="データを取得するにはメールにアクセスする必要があります";
$t18="ユーザー名は既に使用されています";
$t20="メールはすでに使用されています";
$t21="ユーザー名が空または短すぎる";
$t22="名前が空または短すぎる";
$t23="姓が空か短すぎます";
$t24="空の都市または短すぎる都市";
$t25="国を選択します";
$t26="間違ったメール";
$t27="にパスワードを送信しました";
$t28="メールが見つかりません。このメールで新しいアカウントを登録できます";
$t29="小文字と数字のみ：a-z 0-9";
$t30="無効なメール";
$t32="また、あなたはあなたのGoogleアカウントでログインすることができます";
$t33="ログインする";
$t34="データをクリア";
/*
$t31="Googleデータを使用して登録プロセスを高速化できます";
$t35="あなたはGoogleによって承認されていますが、メールはデータベースで見つかりませんでした。このメールで登録しますか？";
$t36="あなたはFacebookによって承認されていますが、電子メールはデータベースで見つかりませんでした。";
$t37="Googleの承認を得ています。Googleのデータを使用して登録しますか？";
$t38="Facebookによって承認されています。Facebookデータを使用して登録しますか？";
*/
$t39="将来の日付を選択してください";

$t04="アップロードしています";
$t001="ビデオフォーマット";
$t002=$d2;
$t003="フィルマーオプション";
$t007="選択したフォーマット ";
$t008="ビデオを選択";

$pp3="誕生日";
$pp4=$t011;
$pp6="国";
$pp7="個人的なコメント";
$pp9="データを保存する";
$pp10="日";
$pp11=$t09;
$pp12=$t010;
$pp24="にメッセージを残します ";
$tt26="日を選択";
$tt27="月を選択";
$tt28="年を選択";

$month="月";
$anyo="年";
$ene="1月";
$feb="2月";
$mar="3月";
$abr="4月";
$may="5月";
$jun="6月";
$jul="7月";
$ago="8月";
$sep="9月";
$oct="10月";
$nov="11月";
$dic="12月";

$not[1]="コメントしました";
$not[2]="さんがあなたにタグを付けました";
$not[3]="愛する";
$not[4]="削除された";
$not[5]="公開された";
$not[6]="あなたを友達リストに追加しました";
$not[7]="登録されました";
$not[8]="メッセージを書いた";
$not[9]="あなたのコメントが気に入りました";
$not[10]="は、あなたに情報を送っています";
$not[11]="が返ってきた";

if (function_exists('mailDatosLogin')){ } else {
 function mailDatosLogin($nom,$nombre,$apellidos,$nick,$pass,$web){
	global $st29,$st30;
	$d['subject']="$nick からの $web でのログインデータ";
	$d['message']=$nom." から次のメッセージが送信されます\n
こんにちは $nombre $apellidos, ログインデータはここにあります:\n
-------------------------------------\n
$st29: $nick\n
$st30: $pass\n
-------------------------------------\n";		
    return $d;
 }
}

$revisa="メールをチェックし、必要に応じてスパムフォルダーを確認します";
$norecibir="到着しない場合は、 $webemail に書き込むことができます";

if (function_exists('mailActivacion')){ } else {
 function mailActivacion($nom,$nombre,$apellidos,$email,$altaid,$web,$webemail){
	global $revisa,$norecibir;
	$d['subject']="$web のユーザーによるアクティブ化";
	$d['message']=$nom." から次のメッセージが送信されます\n\n
こんにちは $nombre $apellidos,\n		
ユーザーをアクティブ化するには、次のリンクを実行する必要があります:\n
https://$web/login.php?estado=alta&altaid=$altaid\n";
	
	echo "<center><p style='color:#181;font-weight:bold'>アクティベーションメールを送信しました！</p>
<p>アクティベーションリンクを記載したメールを $email に送信しました</p>
<p><b>$revisa</b></p>
<p>$norecibir</p></center><br>";
	
	return $d;
 }
}
if (function_exists('mailCambiarEmail')){ } else {
 function mailCambiarEmail($nom,$nombre,$apellidos,$email,$urimail,$url){
	$d['subject']="$url からのメール変更のリクエスト";
	$d['message']=$nom." から次のメッセージが送信されます\n
こんにちは $nombre $apellidos,
$url アカウントのメールを $email に変更する場合は、次のリンクをクリックしてください\n
$urimail\n
それ以外の場合は、このメールを無視してください\n";
    return $d;
 }
}
if (function_exists('humandate')){ } else {
 function humandate($ut,$locale){
	
	$time_difference = strtotime('now') - $ut;

    if ($time_difference >= 60 * 60 * 24 * 7)
    {
        setlocale(LC_TIME, "$locale.UTF-8");
		return strftime('%b %e, %Y',$ut);
    }
    elseif ($time_difference >= 60 * 60 * 24)
    {
		$time_unit='日';
		$divisor = 60 * 60 * 24;
		$time_units = floor($time_difference / $divisor);
		if ($time_units == 1) {
			return '1 ' . $time_unit . ' 前';
		} else {
			return $time_units . ' ' . $time_unit . ' 前';
		}
    }
    elseif ($time_difference >= 60 * 60)
    {
        $time_unit='時間';
		$divisor = 60 * 60;
		$time_units = floor($time_difference / $divisor);
		if ($time_units == 1) {
			return '1 ' . $time_unit . ' 前';
		} else {
			return $time_units . ' ' . $time_unit . ' 前';
		}
    }
    else
    {
        $time_unit='分';
		$divisor = 60;
		$time_units = floor($time_difference / $divisor);
		if ($time_units ==0) {
			return '' . $time_unit . ' 未満';
		}elseif ($time_units ==1) {
			return '1 ' . $time_unit . ' 前';
		} else {
			return $time_units . ' ' . $time_unit . ' 前';
		}
    }
 }
}
$jslang='function t2ago(o){var e=new Date,a=t(e.getTime()/1e3)-o;return a>63072e3?t(a/31536e3)+"年前":a>5256e3?t(a/2628e3)+"ヶ月前":a>1209600?t(a/604800)+"週間前":a>172800?t(a/86400)+"日前":a>7200?t(a/3600)+"時間前":a>120?t(a/60)+"分前":"今";function t(o){return Math.floor(o)}}';
?>