<?
$locale="ru_RU";
$eses="ru";
$lang="ru";
$mem="члены";
$onl="онлайн";
$help="Помогите";
$idioma="язык";
$longer="Должен содержать 3 символа или более";
$bold="Смелый";
$italic="курсивный";
$insert="вставить контент";
$paste="Вставить локальную ссылку";
$selectfile="Нажмите, чтобы выбрать файл или камеру";
$postnews="Опубликовать в другой категории";
$postapoll="Опубликовать опрос";
$postcontent="Разместить контент";
$pcontent="Доступ через тройное меню к";
$pcontentb="Используйте кнопку ниже описания в содержании";
$insertpoll="Вставить опрос";
$polloption="вариант";
$waitres="В ожидании доступных ресурсов";
$expiresin="Истекает";
$days="дней";
$hour="час";
$losevotes="Вы потеряете все голоса. Вы уверены?";
$vote="голос";
$expired="Этот опрос истек, больше не принимает голоса";
$res="Результаты";
$more="загрузить больше контента";
$visitors="посетители";
$browser="браузер";
$visitora="Аналитика посетителей";
$estimated="Расчетное общее количество";
$dev="устройство";
$pho="Фото";
$use="Используемый";
$guide="Руководство по максимизации количества посещений";
$tnma="Активировать сортировку перетаскиванием";
$tnmd="Отключить сортировку путем перетаскивания";
$wrong="неверный логин или пароль";
$createch="Создать список глав";
$chaptertitle="Выберите главу";
$vpcreate="Опубликовать видео часть";
$vpfrom="Видео часть от";
$trend="Смотрю сейчас";
$part="Видео части";
$movie="Художественные фильмы";
$news="Статьи и новости";
$video="Короткометражный фильм";
$photo="Фото";
$sequence="Последовательности фотографий";
$meme="Мемы";
$top="Популярный";
$recom="Связанный";
$all="смотреть все";
$about="опубликовал";
$related="Связано";
$relatedto="Относится к";
$repeat="Режим повторения";
$quality="Качественный";
$subtitles="Субтитры";
$skateproof="Докажите, что вы скейтбордист";
$dragtwofeet="Перетащите две туфли, чтобы они соответствовали друг другу";
$signupparents="Люди, не связанные со скейтбордингом, могут запросить учетную запись, написав на $webemail, указав, зачем им нужна учетная запись.";
$unlock="Разблокировать";
$auto="Автоматическое определение";
$premiere="Онлайн-премьера";
$denunciar="Отчет";
$dentitulo="Почему вы хотите сообщить?";
$den[0]="Администратор получил уведомление";
$den[1]="Неприемлемый контент";
$den[2]="Издевательства или домогательства";
$den[3]="Нарушение авторского права";
$hidepost="Больше не показывать мне этот пост";
$showpost="Покажи мне этот пост";
$watchfullvideo="Вы просмотрели видеофрагмент, хотите посмотреть видео полностью?";
$deluser="Удалить аккаунт";
$deluserm="Вы навсегда и безвозвратно удалите все данные своей учетной записи и свою учетную запись, нажав на";
$crop="обрезать видео";
$slowmotion="замедленное движение";
$addpadding="Добавить отступ";
$nextin="ниже в";
$newplaylist="Новый плейлист";
$writeplaylistname="Напишите название плейлиста";
$duplicado="Повторный";
$donate="Пожертвовать";
$darpropina="Oтправить чаевые";
$monetizar="Монетизировать";
$monetizapierde="Вы навсегда потеряете все поднятое этим видео, $p8";
$monetizainfo="Прочитайте, как это работает";
$pesodelvoto="Вес голоса";
$poderdevoto="Значение голоса";
$contenidoexclusivo="Пожалуйста, не размещайте материалы, которые уже были опубликованы ранее на других платформах. Спасибо.";
$noappmess="Вы не находитесь в приложении Skate Hype.";
$instatrap="$noappmess Чтобы выйти из Instagram, перейдите к меню с тремя точками в правом верхнем углу, откройте...";

$responder="Ответить";
$verrespuestas="Посмотри ответы";
$qrclick="Нажмите на QR-код, чтобы открыть свой Hive Keychain Mobile (приложение для аутентификации Hive) и одобрить запрос";

$retirar="Снять";
$retiros="Снятие средств";
$retiraropciones="Варианты вывода средств";
$nosuficiente="Вы не достигли минимума, необходимого для вывода средств";
$balance="Баланс";
$extrafilmerrewards="Дополнительные вознаграждения для кинорежиссеров";
$susolicitud="Ваш запрос на вывод средств с кодом";
$pendiente="Ваш запрос на снятие средств ожидает подтверждения";
$procesando="в обработке";
$dirretiro="Адрес для вывода средств";
$todocorrecto="Если все верно, подтвердите вывод, перейдя по следующей ссылке";
$gracias="Большое спасибо!";

$hivecuenta="Hive-аккаунт";
$hivecrea="Создать $hivecuenta";
$hivecartera="Установить кошелек Hive Keychain";
$hivecomunidad="Сообщество SkateHive";
$hivesubscribe="Подпишитесь на";
$hiveconnecta="Соединять";

$p1="публиковать";
$p2="редактировать";
$p3c="комментарии";
$p3="ПОКАЗАТЬ БОЛЬШЕ";
$p4="Добавить комментарий...";
$p4m="Оставить сообщение...";
$p6="Удалить комментарий";
$p7="удалять";
$p8="Вы уверены?";
$p9="Вы должны ";
$p10=" или же ";
$p11="регистр";
$p12="Пустой комментарий";
$p27="Обновить видео";
$p27a="Обновить альбом";
$p27f="Обновить фото";
$p28="Удалить последнюю фотографию последовательности";
$p30="встраивать";
$p31="Скачать";
$p32="Скачать трюк";
$p32p="скачал трюк";
$p33="Опубликовать в Plaza & Создать ссылку для скачивания";
$block="Заблокировать этого пользователя";
$tricks="трюк";

$st1="закрыть это меню";
$st2="Скопируйте эту ссылку";
$st2t="Скопируйте в эту секунду";
$st3="скопированный";
$st5="Перейти к сообщению";
$st6="Поделиться";
$st7="друзья";
$st8="Удалить друга";
$st9="Добавить в друзья";
$st10="Список друзей";
$st10m="Следующий";
$st10o="Последователи";
$st11="близко";
$st12="Название должно содержать не менее $minwordtit слов и не более $maxchartit персонажи";
$st13="Название должно содержать не менее $minworddesc слов и не более $maxchardesc персонажи";
$st14="заглавие (минимум $minwordtit слова)";
$st15="Описание (минимум $minworddesc слова)";
$st16="Сохранить и опубликовать";
$st18="удалять";
$st18a="добавлять";
$st19="&#9776; $p2";
$st20="спасти";
$st21="взгляды";
$st22="Поиск";
$st23="копия";
$st25="Зарегистрироваться!";
$mdesc[0]="Добро пожаловать! Это сайт, посвященный скейтбордингу, который позволяет вам делиться видео, фотографиями и эпизодами.";
$mdesc[1]="Доступны приложения для iOS и Android, которые поддерживают ChromeCast и Airplay.";
$mdesc[2]="Никаких файлов cookie, никакого отслеживания данных, только скейтбординг.";
$st27="Новый альбом";
$st28="Вы должны быть авторизованы. Войти?";
$st29="имя пользователя";
$st30="пароль";
$st31="Добро пожаловать в Skate Hype";
$st32="Кажется, вы загружаете видео в другую вкладку или браузер. Вы должны закончить процесс перед загрузкой другого видео.";
$st33="Удалить все и начать";
$st34="У вас нет аккаунта?";
$st35="Продолжайте и продолжайте здесь";

$dd0="Публикации";
$dd1="Был отмечен в";
$dd2="Альбом";
$dd3="Плейлисты";

$a4="&#9776; управлять содержимым альбома";
$a5="Весь контент. Нажмите, чтобы поставить.";
$a6="Содержание альбома. Нажмите, чтобы удалить.";
$a7="Создать скриншот";
$a8="Спрятать";
$a2="Удалить этот альбом. Вы уверены?";

$ing1="Живет в";
$ing2="и является";
$ing3="лет";

$m1="Авторизоваться";
$m2="Зарегистрироваться";
$m3="Панель управления";
$m4="Мой профайл";
$m5="Если вы потеряли свой пароль, нажмите на ";
$m6="восстановить пароль";
$m7="Читать уведомления";

$titlemain="Skate Hype";
$keywordsmain="скейт,скейтбордисты,скейтбординг,видео,скейт видео,видеоплатформа";
$descriptionmain=$mdesc[0];

$afp="Пожалуйста, обновите фотографию своего профиля";

$d0="Загрузить или выбрать миниатюру видео";
$d1="Загрузить";
$d2="Выбрать";
$d3="Воспроизведите видео до нужного кадра, затем сохраните его.";
$d4="Искать";
$d5="выбранный";
$d6="Сохранить";

$t1="Удалить это видео?";
$t1f="Удалить это фото?";
$t2="разговор:";
$t3="Пометить меня";
$t4="меченый";
$t5="мечение";
$t6="Изменить соотношение сторон";
$t7="Изменить тип сообщения";
$t9="Удалить тег";
$t10="Введите имя пользователя";
$t11="Выберите пользователя";
$t12="пометить пользователей";
$t13="Отмена";
$t14="Выберите пользователя";

$d00=$m3;
$d01="Изменить данные профиля";
$d02="Изменить фотографию профиля";
$d03="Профиль";
$d04="содержание";
$d06="Сменить пароль";
$d7="Загрузить фото";
$d8="Загрузить последовательность фотографий";
$d9="Загрузить видео";
$d11="Изменить";
$d13="Выйти";
$d16="Загрузить";
$d17="Выберите <b>в правильном порядке</b>, все изображения jpg, которые формируют последовательность, затем загрузите их и подтвердите публикацию. До 24 фото.";
$d18="Выберите фотографии";
$d19="Все фото? затем нажмите на";
$d20="Загрузить все фото";
$d21="Если они в правильном порядке, нажмите на";
$d22="в противном случае";
$d23="Отмена";
$d24="Изменить фоновое фото профиля";
$d25="Прежний пароль";
$d26="новый пароль";
$d27=" послать ";
$d33="Минимум 8 символов, одна заглавная и одна цифра";
$d34="Пароль изменен, проверьте вашу электронную почту";
$d35="кодирование видео";
$d36="Мультиплексирование файлов и отделка";
$d39="Ждите всех шагов";
$d40="Публиковать";
$d41="Уведомления";
$d42="Удалить уведомления";
$d43="Читать уведомления";
$d44="При выходе загрузка будет отменена";
$d47="Вариант сохранен";
$d49="Неверный URL, следуйте примерам";
$d56="Отменить и удалить";
$d62="Читать сообщение";
$d63="Читать сообщения";
$d64="политика конфиденциальности";
$d65="я принимаю";

$t00=$m2;
$t01="Мы отправили вам письмо для подтверждения";	
$t02="Иногда это занимает несколько минут, наберитесь терпения. Если вы хотите повторить процесс регистрации, нажмите ";	
$t03="удалить куки и обновить";
$t08="$st29 (от 4 до 24 символов)";
$t09="настоящее имя";
$t010="фамилия или фамилия";
$t011="город (где ты катаешься)";
$t012=$m2;
$t15="Введите адрес электронной почты, который вы использовали для регистрации";
$t16="Доступ через вашу электронную почту";
$t17="Вам нужно будет получить доступ к своей почте, чтобы получить данные";
$t18="Имя пользователя уже используется";
$t20="Электронная почта уже используется";
$t21="Имя пользователя пустое или слишком короткое";
$t22="Имя пустое или слишком короткое";
$t23="Фамилия пуста или слишком коротка";
$t24="Город пустой или слишком короткий";
$t25="Выберите страну";
$t26="Неправильный адрес электронной почты";
$t27="Мы отправили вам пароль для";
$t28="Электронная почта не найдена, вы можете зарегистрировать новую учетную запись с этим адресом электронной почты";
$t29="Только строчные буквы и цифры: a-z 0-9";
$t30="Неверный адрес электронной почты";
$t32="Также вы можете войти через свой аккаунт Google";
$t33="Авторизоваться";
$t34="Очистить данные";
/*
$t31="Вы можете использовать свои данные Google для ускорения процесса регистрации";
$t35="Вы авторизованы Google, но электронная почта не была найдена в базе данных. Вы хотите зарегистрироваться на эту электронную почту?";
$t36="Вы авторизованы Facebook, но электронная почта не была найдена в базе данных. Вы хотите зарегистрироваться на эту электронную почту?";
$t37="Вы авторизованы Google, хотите ли вы использовать свои данные Google для регистрации?";
$t38="Вы авторизованы Facebook, хотите ли вы использовать свои данные Facebook для регистрации?";
*/
$t39="Выберите дату в будущем";

$t04="Выгрузка";
$t001="Формат видео";
$t002=$d2;
$t003="Варианты Filmer";
$t007="Выбранный формат: ";
$t008="Выберите видео";

$pp3="Дата рождения";
$pp4=ucfirst($t011);
$pp6="Страна";
$pp7="Личные комментарии";
$pp9="Сохранить данные";
$pp10=ucfirst($t09);
$pp11=ucfirst($t010);
$pp12="Фамилия";
$pp24="оставить сообщение ";
$tt26="Выберите день";
$tt27="Выберите месяц";
$tt28="Выберите год";

$month="Месяц";
$anyo="Год";
$ene="январь";
$feb="февраль";
$mar="марш";
$abr="апреля";
$may="май";
$jun="июнь";
$jul="July";
$ago="июль";
$sep="сентябрь";
$oct="октября";
$nov="ноябрь";
$dic="Декабрь";

$not[1]="прокомментировал";
$not[2]="отметил вас в";
$not[3]="любови";
$not[4]="Исключен";
$not[5]="опубликованный";
$not[6]="добавил вас в список друзей";
$not[7]="был зарегистрирован";
$not[8]="написал вам сообщение";
$not[9]="понравился ваш комментарий";
$not[10]="прислал вам наводку";
$not[11]="ответил";

if (function_exists('mailDatosLogin')){ } else {
 function mailDatosLogin($nom,$nombre,$apellidos,$nick,$pass,$web){
	global $st29,$st30;
	$d['subject']="Данные для входа из $nick на $web";
	$d['message']=$nom.", отправляет вам следующее сообщение:\n
Здравствуй $nombre $apellidos, Вы можете найти свои данные для входа здесь:\n
-------------------------------------\n
$st29: $nick\n
$st30: $pass\n
-------------------------------------\n";		
    return $d;
 }
}

$revisa="Проверьте свою электронную почту и, если необходимо, папку со спамом";
$norecibir="Если он не прибыл, вы можете написать в $webemail";

if (function_exists('mailActivacion')){ } else {
 function mailActivacion($nom,$nombre,$apellidos,$email,$altaid,$web,$webemail){
	global $revisa,$norecibir;
	$d['subject']="Пользовательская активация $web";
	$d['message']=$nom.", отправляет вам следующее сообщение:\n\n
Здравствуй $nombre $apellidos,\n		
Для активации вашего пользователя необходимо выполнить следующую ссылку:\n
https://$web/login.php?estado=alta&altaid=$altaid\n";
	
	echo "<center><p style='color:#181;font-weight:bold'>Письмо с активацией отправлено!</p>
<p>Мы отправили письмо на адрес $email со ссылкой для активации</p>
<p><b>$revisa</b></p>
<p>$norecibir</p></center><br>";
	
	return $d;
 }
}
if (function_exists('mailCambiarEmail')){ } else {
 function mailCambiarEmail($nom,$nombre,$apellidos,$email,$urimail,$url){
	$d['subject']="Запрос на изменение адреса электронной почты от $url";
	$d['message']=$nom.", отправляет вам следующее сообщение:\n
Здравствуй $nombre $apellidos,
если вы хотите изменить адрес электронной почты вашей учетной записи $url на $email, перейдите по следующей ссылке:\n
$urimail\n
В противном случае игнорируйте это письмо.\n";
    return $d;
 }
}
if (function_exists('humandate')){ } else {
 function humandate($ut,$locale){
	
	$time_difference = strtotime('now') - $ut;

    if ($time_difference >= 60 * 60 * 24 * 7)
    {
        setlocale(LC_TIME, "$locale.UTF-8");
		return strftime('%b %e, %Y',$ut);
    }
    elseif ($time_difference >= 60 * 60 * 24)
    {
		$time_unit='день';
		$divisor = 60 * 60 * 24;
		$time_units = floor($time_difference / $divisor);
		if ($time_units == 1) {
			return '1 ' . $time_unit . ' назад';
		} else {
			return $time_units . ' ' . $time_unit . ' назад';
		}
    }
    elseif ($time_difference >= 60 * 60)
    {
        $time_unit='час';
		$divisor = 60 * 60;
		$time_units = floor($time_difference / $divisor);
		if ($time_units == 1) {
			return '1 ' . $time_unit . ' назад';
		} else {
			return $time_units . ' ' . $time_unit . ' назад';
		}
    }
    else
    {
        $time_unit='минут';
		$divisor = 60;
		$time_units = floor($time_difference / $divisor);
		if ($time_units ==0) {
			return 'Менее ' . $time_unit . ' назад';
		}elseif ($time_units ==1) {
			return '1 ' . $time_unit . ' назад';
		} else {
			return $time_units . ' ' . $time_unit . ' назад';
		}
    }
 }
}
$jslang='function t2ago(o){var e=new Date,a=t(e.getTime()/1e3)-o;return a>63072e3?t(a/31536e3)+" года":a>5256e3?t(a/2628e3)+" мес.":a>1209600?t(a/604800)+" недели":a>172800?t(a/86400)+" дня":a>7200?t(a/3600)+" ч.":a>120?t(a/60)+" минуты":"Теперь";function t(o){return Math.floor(o)}}';
?>