<?
$locale="th_TH";
$eses="th";
$lang="th";
$mem="สมาชิก";
$onl="ออนไลน์";
$help="ช่วยด้วย";
$idioma="ภาษา";
$longer="ต้องมีอักขระ 3 ตัวขึ้นไป";
$bold="กล้า";
$italic="ตัวเอียง";
$insert="แทรกเนื้อหา";
$paste="วางลิงค์ท้องถิ่น";
$selectfile="กดเพื่อเลือกไฟล์หรือกล้อง";
$postnews="โพสต์ในหมวดหมู่อื่น";
$postapoll="โพสต์แบบสำรวจ";
$postcontent="โพสต์เนื้อหา";
$pcontent="เข้าถึงผ่านเมนูจุดสามจุดเพื่อ";
$pcontentb="ใช้ปุ่มด้านล่างคำอธิบายในเนื้อหา";
$insertpoll="แทรกการสำรวจความคิดเห็น";
$polloption="ตัวเลือก";
$waitres="รอทรัพยากรที่มีอยู่";
$expiresin="หมดอายุใน";
$days="วัน";
$hour="ชั่วโมง";
$losevotes="คุณจะเสียคะแนนทั้งหมด คุณแน่ใจไหม?";
$vote="โหวต";
$expired="แบบสำรวจนี้หมดอายุแล้วไม่ยอมรับการลงคะแนนอีกต่อไป";
$res="ผล";
$more="โหลดเนื้อหาเพิ่มเติม";
$visitors="ผู้เข้าชม";
$browser="เบราว์เซอร์";
$visitora="การวิเคราะห์ผู้เยี่ยมชม";
$estimated="จำนวนทั้งหมดโดยประมาณ";
$dev="เครื่อง";
$use="มือสอง";
$pho="ภาพถ่าย";
$guide="คำแนะนำเพื่อเพิ่มจำนวนการเข้าชมให้สูงสุด";
$tnma="เปิดใช้งานการจัดเรียงโดยการลากและวาง";
$tnmd="ปิดใช้งานการจัดเรียงโดยการลากและวาง";
$wrong="ชื่อผู้ใช้หรือรหัสผ่านผิด";
$createch="สร้างรายการบท";
$chaptertitle="เลือกบท";
$vpcreate="โพสต์ส่วนวิดีโอ";
$vpfrom="ส่วนวิดีโอจาก";
$trend="กำลังดูอยู่";
$part="ส่วนวิดีโอ";
$movie="ภาพยนตร์สารคดี";
$news="บทความและข่าวสาร";
$video="หนังสั้น";
$photo="ภาพถ่าย";
$sequence="ลำดับภาพ";
$meme="มส์";
$top="เป็นที่นิยม";
$recom="ที่เกี่ยวข้อง";
$all="ดูทั้งหมด";
$about="ได้เผยแพร่";
$related="ที่เกี่ยวข้อง";
$relatedto="ที่เกี่ยวข้องกับ";
$repeat="ทำซ้ำโหมด";
$quality="คุณภาพ";
$subtitles="คำบรรยาย";
$skateproof="พิสูจน์ว่าคุณเป็นนักสเก็ตบอร์ด";
$dragtwofeet="ลากและวางรองเท้าสองคู่ให้เข้ากัน";
$signupparents="ผู้ที่ไม่เกี่ยวข้องกับการเล่นสเก็ตบอร์ดสามารถขอบัญชีได้โดยเขียนถึง $webemail เพื่อระบุสาเหตุที่พวกเขาต้องการบัญชี";
$unlock="ปลดล็อค";
$auto="ตรวจจับอัตโนมัติ";
$premiere="รอบปฐมทัศน์ออนไลน์";
$denunciar="รายงาน";
$dentitulo="ทำไมถึงอยากรายงานตัว?";
$den[0]="แอดมินได้รับแจ้งแล้ว";
$den[1]="เนื้อหาไม่เหมาะสม";
$den[2]="การกลั่นแกล้งหรือการล่วงละเมิด";
$den[3]="การละเมิดลิขสิทธิ์";
$hidepost="อย่าแสดงโพสต์นี้ให้ฉันเห็นอีก";
$showpost="แสดงโพสต์นี้ให้ฉันดู";
$watchfullvideo="คุณได้ดูส่วนวิดีโอคุณต้องการดูวิดีโอแบบเต็มหรือไม่?";
$deluser="ลบบัญชี";
$deluserm="คุณจะลบข้อมูลบัญชีและบัญชีของคุณทั้งหมดอย่างถาวรและไม่สามารถเพิกถอนได้โดยการคลิกที่";
$crop="ครอบตัดวิดีโอ";
$slowmotion="เคลื่อนที่ช้า";
$addpadding="เพิ่มช่องว่างภายใน";
$nextin="ถัดไปใน";
$newplaylist="เพลย์ลิสต์ใหม่";
$writeplaylistname="เขียนชื่อเพลย์ลิสต์";
$duplicado="ซ้ำแล้วซ้ำเล่า";
$donate="บริจาค";
$darpropina="ส่งทิปมาที่";
$monetizar="สร้างรายได้";
$monetizapierde="คุณจะสูญเสียทุกอย่างที่เกิดขึ้นกับวิดีโอนี้อย่างถาวร, $p8";
$monetizainfo="อ่านวิธีการทำงาน";
$pesodelvoto="โหวตน้ำหนัก";
$poderdevoto="ค่าโหวต";
$contenidoexclusivo="โปรดอย่าโพสต์เนื้อหาที่เคยเผยแพร่บนแพลตฟอร์มอื่นก่อนหน้านี้ ขอขอบคุณ.";
$noappmess="คุณไม่ได้อยู่ในแอพ Skate Hype";
$instatrap="$noappmess หากต้องการออกจาก Instagram ให้ไปที่เมนูสามจุดที่ด้านบนขวา เปิดด้วย...";

$responder="ตอบ";
$verrespuestas="ดูคำตอบ";
$qrclick="คลิกที่ QR Code เพื่อเปิด Hive Keychain Mobile (แอป Hive Authentication) และอนุมัติคำขอ";

$retirar="ถอนออก";
$retiros="การถอนเงิน";
$retiraropciones="ตัวเลือกการถอนเงิน";
$nosuficiente="คุณยังไม่ถึงเกณฑ์ขั้นต่ำในการถอน";
$balance="ยอดคงเหลือ";
$extrafilmerrewards="รางวัลผู้สร้างภาพยนตร์พิเศษ";
$susolicitud="คำขอถอนเงินของคุณด้วยรหัส";
$pendiente="คำขอถอนเงินของคุณอยู่ระหว่างรอการยืนยัน";
$procesando="กำลังดำเนินการ";
$dirretiro="ที่อยู่ถอนเงิน";
$todocorrecto="หากทุกอย่างถูกต้อง โปรดยืนยันการถอนโดยไปที่ลิงก์ต่อไปนี้";
$gracias="ขอบคุณมาก ๆ!";

$hivecuenta="บัญชี Hive";
$hivecrea="สร้าง $hivecuenta";
$hivecartera="ติดตั้งกระเป๋าเงิน Hive Keychain";
$hivecomunidad="ชุมชน SkateHive";
$hivesubscribe="สมัครสมาชิก";
$hiveconnecta="เชื่อมต่อ";

$p1="ประกาศ";
$p2="แก้ไข";
$p3c="ความคิดเห็น";
$p3="แสดงมากขึ้น";
$p4="เพิ่มความคิดเห็น...";
$p4m="ฝากข้อความ...";
$p6="ลบความคิดเห็น";
$p7="ลบ";
$p8="คุณแน่ใจไหม?";
$p9="คุณต้อง ";
$p10=" หรือ ";
$p11="การลงทะเบียน";
$p12="ความคิดเห็นที่ว่างเปล่า";
$p27="อัปเดตนิ้วหัวแม่มือของวิดีโอ";
$p27a="อัปเดตนิ้วหัวแม่มือของอัลบั้ม";
$p27f="อัปเดตรูปภาพ";
$p28="ลบภาพสุดท้ายของลำดับ";
$p30="ฝัง";
$p31="ดาวน์โหลด";
$p32="ดาวน์โหลดเคล็ดลับ";
$p32p="ได้ดาวน์โหลดเคล็ดลับ";
$p33="ส่งถึง Plaza & สร้างลิงค์ดาวน์โหลด";
$block="บล็อกผู้ใช้รายนี้";
$tricks="เคล็ดลับ";

$st1="ปิดเมนูนี้";
$st2="คัดลอกลิงค์นี้";
$st2t="คัดลอกในวินาทีนี้";
$st3="คัดลอก";
$st5="ไปที่โพสต์";
$st6="หุ้น";
$st7="เพื่อน";
$st8="ลบเพื่อน";
$st9="เพิ่มเพื่อน";
$st10="รายชื่อเพื่อน";
$st10m="กำลังติดตาม";
$st10o="ผู้ติดตาม";
$st11="ปิด";
$st12="ชื่อต้องมีอย่างน้อย $minwordtit คำและไม่เกิน $maxchartit ตัว";
$st13="คำอธิบายต้องมีอย่างน้อย $minworddesc คำและไม่เกิน $maxchardesc ตัวอักษร";
$st14="ชื่อ (อย่างน้อย $minwordtit คำ)";
$st15="คำอธิบาย (ขั้นต่ำ $minworddesc คำ)";
$st16="บันทึกและเผยแพร่";
$st18="ลบ";
$st18a="เพิ่ม";
$st19="&#9776; $p2";
$st20="บันทึก";
$st21="มุมมอง";
$st22="ค้นหา";
$st23="สำเนา";
$st25="ลงชื่อ!";
$mdesc[0]="ยินดีต้อนรับ! นี่คือไซต์สำหรับเล่นสเก็ตบอร์ดโดยเฉพาะ ซึ่งอนุญาตให้คุณแชร์วิดีโอ ภาพถ่าย และลำดับ";
$mdesc[1]="แอป iOS และ Android พร้อมใช้งานและรองรับ ChromeCast และ Airplay";
$mdesc[2]="ไม่มีคุกกี้ ไม่มีการติดตามข้อมูล มีแต่สเก็ตบอร์ด";
$st27="อัลบั้มใหม่";
$st28="คุณต้องเข้าสู่ระบบเข้าสู่ระบบ?";
$st29="ชื่อผู้ใช้";
$st30="รหัสผ่าน";
$st31="ยินดีต้อนรับสู่ Skate Hype";
$st32="ดูเหมือนว่าคุณกำลังอัปโหลดวิดีโอในแท็บหรือเบราว์เซอร์อื่น คุณต้องเสร็จสิ้นกระบวนการก่อนที่จะอัปโหลดวิดีโออื่น";
$st33="ลบทุกอย่างและเริ่ม";
$st34="คุณยังไม่มีบัญชี?";
$st35="ดำเนินการต่อและดำเนินการต่อที่นี่";

$dd0="สิ่งพิมพ์";
$dd1="ถูกติดแท็กใน";
$dd2="อัลบั้ม";
$dd3="เพลย์ลิสต์";

$a4="&#9776; จัดการเนื้อหาของอัลบั้ม";
$a5="เนื้อหาทั้งหมด คลิกเพื่อวาง";
$a6="เนื้อหาของอัลบั้ม คลิกเพื่อลบ";
$a7="สร้างภาพหน้าจอ";
$a8="ซ่อน";
$a2="ลบอัลบั้มนี้ คุณแน่ใจไหม?";

$ing1="อาศัยอยู่ใน";
$ing2="และคือ";
$ing3="ปี";

$m1="เข้าสู่ระบบ";
$m2="ลงชื่อ";
$m3="แผงควบคุม";
$m4="ประวัติของฉัน";
$m5="หากคุณทำรหัสผ่านหายให้คลิกที่ ";
$m6="กู้คืนรหัสผ่าน";
$m7="อ่านการแจ้งเตือน";

$titlemain="Skate Hype";
$keywordsmain="เล่นสเก็ต, สเก็ตบอร์ด, สเก็ตบอร์ด, วิดีโอ, วิดีโอสเก็ต, แพลตฟอร์มวิดีโอ";
$descriptionmain=$mdesc[0];

$afp="โปรดอัปเดตรูปโปรไฟล์ของคุณ";

$d0="อัปโหลดหรือเลือกภาพขนาดย่อของวิดีโอ";
$d1="ที่อัพโหลด";
$d2="เลือก";
$d3="เล่นวิดีโอได้ถึงเฟรมที่ต้องการจากนั้นบันทึก";
$d4="ค้นหา";
$d5="เลือก";
$d6="บันทึก";

$t1="นำวิดีโอนี้ออกหรือไม่";
$t1f="ลบรูปภาพนี้ไหม";
$t2="การสนทนา";
$t3="แท็กฉัน";
$t4="แท็ก";
$t5="การติดแท็ก";
$t6="เปลี่ยนอัตราส่วนภาพ";
$t7="เปลี่ยนประเภทโพสต์";
$t9="ลบแท็ก";
$t10="พิมพ์ชื่อของผู้ใช้";
$t11="เลือกผู้ใช้";
$t12="ผู้ใช้แท็ก";
$t13="ยกเลิก";
$t14="เลือกผู้ใช้";

$d00=$m3;
$d01="แก้ไขข้อมูลโปรไฟล์";
$d02="เปลี่ยนรูปโปรไฟล์ของคุณ";
$d03="ข้อมูลส่วนตัว";
$d04="เนื้อหา";
$d06="เปลี่ยนรหัสผ่าน";
$d7="อัพโหลดรูปภาพ";
$d8="อัพโหลดลำดับภาพถ่าย";
$d9="อัปโหลดวิดีโอ";
$d11="เปลี่ยนแปลง";
$d13="ออกจากระบบ";
$d16="ที่อัพโหลด";
$d17="เลือกในลำดับที่ถูกต้องรูปภาพ jpg ทั้งหมดที่เป็นลำดับจากนั้นอัปโหลดและยืนยันที่จะเผยแพร่ มากถึง 24 รูป";
$d18="เลือกรูปภาพ";
$d19="รูปทั้งหมดหรือไม่ จากนั้นคลิกที่";
$d20="อัปโหลดรูปภาพทั้งหมด";
$d21="หากพวกเขาอยู่ในลำดับที่ถูกต้องคลิกที่";
$d22="มิฉะนั้น";
$d23="ยกเลิก";
$d24="เปลี่ยนรูปโปรไฟล์พื้นหลังของคุณ";
$d25="รหัสผ่านเก่า";
$d26="รหัสผ่านใหม่";
$d27=" ส่ง ";
$d33="อย่างน้อย 8 ตัวอักษรหนึ่งตัวพิมพ์ใหญ่และหนึ่งหมายเลข";
$d34="เปลี่ยนรหัสผ่านแล้วเช็คอีเมลของคุณ";
$d35="การเข้ารหัสวิดีโอ";
$d36="ไฟล์มัลติเพล็กซ์และการตกแต่ง";
$d39="รอทุกขั้นตอน";
$d40="ประกาศ";
$d41="การแจ้งเตือน";
$d42="ลบการแจ้งเตือน";
$d43="อ่านการแจ้งเตือน";
$d44="หากออกจากการอัปโหลดจะถูกยกเลิก";
$d47="บันทึกตัวเลือกแล้ว";
$d49="URL ผิดให้ทำตามตัวอย่าง";
$d56="ยกเลิกและลบ";
$d62="อ่านข้อความ";
$d63="อ่านข้อความ";
$d64="นโยบายความเป็นส่วนตัว";
$d65="ฉันยอมรับ";

$t00=$m2;
$t01="เราส่งอีเมลถึงคุณเพื่อยืนยัน";	
$t02="บางครั้งก็ใช้เวลาสักครู่อดทน หากคุณต้องการทำซ้ำขั้นตอนการลงทะเบียนกด ";	
$t03="ลบคุกกี้และรีเฟรช";
$t08="$st29 (จาก 4 ถึง 24 ตัวอักษร)";
$t09="ชื่อจริง";
$t010="นามสกุลหรือชื่อสกุล";
$t011="เมือง (ที่คุณเล่นสเก็ต)";
$t012=$m2;
$t15="ใส่อีเมลที่คุณใช้ในการสมัคร";
$t16="เข้าถึงผ่านอีเมลของคุณ";
$t17="คุณจะต้องเข้าถึงอีเมลของคุณเพื่อดึงข้อมูล";
$t18="มีการใช้ชื่อผู้ใช้แล้ว";
$t20="มีการใช้อีเมลแล้ว";
$t21="ชื่อผู้ใช้ว่างเปล่าหรือสั้นเกินไป";
$t22="ชื่อว่างหรือสั้นเกินไป";
$t23="นามสกุลว่างเปล่าหรือสั้นเกินไป";
$t24="เมืองว่างเปล่าหรือสั้นเกินไป";
$t25="เลือกประเทศ";
$t26="ผิดอีเมล";
$t27="เราได้ส่งรหัสผ่านไปให้คุณแล้ว";
$t28="ไม่พบอีเมลคุณสามารถลงทะเบียนบัญชีใหม่ด้วยอีเมลนี้";
$t29="ตัวอักษรพิมพ์เล็กและตัวเลขเท่านั้น: a-z 0-9";
$t30="อีเมลไม่ถูกต้อง";
$t32="นอกจากนี้คุณสามารถเข้าสู่ระบบด้วยบัญชี Google ของคุณ";
$t33="เข้าสู่ระบบ";
$t34="ข้อมูลชัดเจน";
/*
$t31="คุณสามารถใช้ข้อมูล Google ของคุณเพื่อการลงทะเบียนที่รวดเร็วขึ้น";
$t35="คุณได้รับอนุญาตจาก Google แต่ไม่พบอีเมลในฐานข้อมูลคุณต้องการลงทะเบียนด้วยอีเมลนี้หรือไม่";
$t36="คุณได้รับอนุญาตจาก Facebook แต่ไม่พบอีเมลในฐานข้อมูลคุณต้องการลงทะเบียนด้วยอีเมลนี้หรือไม่?";
$t37="คุณได้รับอนุญาตจาก Google คุณต้องการใช้ข้อมูล Google ของคุณเพื่อลงทะเบียนหรือไม่?";
$t38="คุณได้รับอนุญาตจาก Facebook คุณต้องการใช้ข้อมูล Facebook ของคุณเพื่อลงทะเบียนหรือไม่?";
*/
$t39="เลือกวันที่ในอนาคต";

$t04="อัปโหลด";
$t001="รูปแบบวิดีโอ";
$t002=$d2;
$t003="ตัวเลือก Filmer";
$t007="รูปแบบที่เลือก ";
$t008="เลือกวิดีโอ";

$pp3="วันที่เกิด";
$pp4=$t011;
$pp6="ประเทศ";
$pp7="ความคิดเห็นส่วนตัว";
$pp9="บันทึกข้อมูล";
$pp10="วัน";
$pp11=$t09;
$pp12=$t010;
$pp24="ฝากข้อความถึง ";
$tt26="เลือกวัน";
$tt27="เลือกเดือน";
$tt28="เลือกปี";

$month="เดือน";
$anyo="ปี";
$ene="มกราคม";
$feb="กุมภาพันธ์";
$mar="มีนาคม";
$abr="เมษายน";
$may="อาจ";
$jun="มิถุนายน";
$jul="กรกฎาคม";
$ago="สิงหาคม";
$sep="กันยายน";
$oct="ตุลาคม";
$nov="พฤศจิกายน";
$dic="ธันวาคม";

$not[1]="แสดงความคิดเห็น";
$not[2]="ได้ติดแท็กคุณใน";
$not[3]="รัก";
$not[4]="ที่ถูกลบ";
$not[5]="การตีพิมพ์";
$not[6]="เพิ่มคุณในรายชื่อเพื่อน";
$not[7]="ได้รับการลงทะเบียน";
$not[8]="เขียนข้อความถึงคุณ";
$not[9]="ชอบความคิดเห็นของคุณ";
$not[10]="ได้ส่งทิปให้คุณ";
$not[11]="ได้ตอบกลับ";

if (function_exists('mailDatosLogin')){ } else {
 function mailDatosLogin($nom,$nombre,$apellidos,$nick,$pass,$web){
	global $st29,$st30;
	$d['subject']="ข้อมูลการเข้าสู่ระบบจาก $nick ที่ $web";
	$d['message']=$nom.", ส่งข้อความต่อไปนี้ถึงคุณ\n
สวัสดี $nombre $apellidos, คุณสามารถค้นหาข้อมูลการเข้าสู่ระบบได้ที่นี่:\n
-------------------------------------\n
$st29: $nick\n
$st30: $pass\n
-------------------------------------\n";		
    return $d;
 }
}

$revisa="ตรวจสอบอีเมลของคุณและหากจำเป็นโฟลเดอร์สแปม";
$norecibir="หากไม่มาถึงคุณสามารถเขียนถึง $webemail";

if (function_exists('mailActivacion')){ } else {
 function mailActivacion($nom,$nombre,$apellidos,$email,$altaid,$web,$webemail){
	global $revisa,$norecibir;
	$d['subject']="การเปิดใช้งานผู้ใช้ของ $web";
	$d['message']=$nom.", ส่งข้อความต่อไปนี้ถึงคุณ\n\n
สวัสดี $nombre $apellidos,\n		
ในการเปิดใช้งานผู้ใช้ของคุณคุณต้องใช้งานลิงค์ต่อไปนี้:\n
https://$web/login.php?estado=alta&altaid=$altaid\n";
	
	echo "<center><p style='color:#181;font-weight:bold'>ส่งอีเมลยืนยันการใช้งานแล้ว!</p>
<p>เราได้ส่งอีเมลไปที่ $email ด้วยลิงค์เปิดใช้งาน</p>
<p><b>$revisa</b></p>
<p>$norecibir</p></center><br>";
	
	return $d;
 }
}
if (function_exists('mailCambiarEmail')){ } else {
 function mailCambiarEmail($nom,$nombre,$apellidos,$email,$urimail,$url){
	$d['subject']="ขอเปลี่ยนอีเมลจาก $url";
	$d['message']=$nom.", ส่งข้อความต่อไปนี้ถึงคุณ\n
สวัสดี $nombre $apellidos,
หากคุณต้องการเปลี่ยนอีเมลของบัญชี $url เป็น $email ตามลิงก์ถัดไป\n
$urimail\n
มิฉะนั้นละเว้นอีเมลนี้.\n";
    return $d;
 }
}
if (function_exists('humandate')){ } else {
 function humandate($ut,$locale){
	
	$time_difference = strtotime('now') - $ut;

    if ($time_difference >= 60 * 60 * 24 * 7)
    {
        setlocale(LC_TIME, "$locale.UTF-8");
		return strftime('%b %e, %Y',$ut);
    }
    elseif ($time_difference >= 60 * 60 * 24)
    {
		$time_unit='วัน';
		$divisor = 60 * 60 * 24;
		$time_units = floor($time_difference / $divisor);
		if ($time_units == 1) {
			return '1 ' . $time_unit . ' ที่แล้ว';
		} else {
			return $time_units . ' ' . $time_unit . ' ที่แล้ว';
		}
    }
    elseif ($time_difference >= 60 * 60)
    {
        $time_unit='ชั่วโมง';
		$divisor = 60 * 60;
		$time_units = floor($time_difference / $divisor);
		if ($time_units == 1) {
			return '1 ' . $time_unit . ' ที่แล้ว';
		} else {
			return $time_units . ' ' . $time_unit . ' ที่แล้ว';
		}
    }
    else
    {
        $time_unit='นาที';
		$divisor = 60;
		$time_units = floor($time_difference / $divisor);
		if ($time_units ==0) {
			return 'น้อยกว่า 1 ' . $time_unit . ' ที่แล้ว';
		}elseif ($time_units ==1) {
			return '1 ' . $time_unit . ' ที่แล้ว';
		} else {
			return $time_units . ' ' . $time_unit . ' ที่แล้ว';
		}
    }
 }
}
$jslang='function t2ago(o){var e=new Date,a=t(e.getTime()/1e3)-o;return a>63072e3?t(a/31536e3)+"ปีที่แล้ว":a>5256e3?t(a/2628e3)+"เดือนที่ผ่านมา":a>1209600?t(a/604800)+"สัปดาห์ที่ผ่านมา":a>172800?t(a/86400)+"วันที่ผ่านมา":a>7200?t(a/3600)+"ชม. ที่แล้ว":a>120?t(a/60)+"นาทีที่แล้ว":"ตอนนี้";function t(o){return Math.floor(o)}}';
?>